zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/main.c
/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 *
 * @return void
 *
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
                            uint16_t PANId,
                            uint8_t LogicalChannel,
                            uint8_t ChannelPage)
{
	
}

/* Alert to indicate something has gone wrong in the application */
static void app_alert(void)
{
    while (1)
    {
		#if LED_COUNT > 0
		LED_Toggle(LED0);
		#endif

		#if LED_COUNT > 1
		LED_Toggle(LED1);
		#endif

		#if LED_COUNT > 2
		LED_Toggle(LED2);
		#endif

		#if LED_COUNT > 3
		LED_Toggle(LED3);
		#endif

		#if LED_COUNT > 4
		LED_Toggle(LED4);
		#endif

		#if LED_COUNT > 5
		LED_Toggle(LED5);
		#endif

		#if LED_COUNT > 6
		LED_Toggle(LED6);
		#endif

		#if LED_COUNT > 7
		LED_Toggle(LED7);
		#endif
		delay_us(0xFFFF);
	}
}

/*
 * @brief Callback function for the application timer
 *        initiating polling of coordinator
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void app_initiate_polling(void *parameter)
{
    /*
     * Initiate MLME-POLL.request service and have it placed in the MLME-SAP queue.
     *
     * @param CoordAddrSpec   Pointer to wpan_addr_spec_t structure for the coordinator.
     *
     * @return true - success; false - buffer not availability or queue full.
     */
    wpan_addr_spec_t coord_addr_spec;

    coord_addr_spec.AddrMode = WPAN_ADDRMODE_SHORT;
    coord_addr_spec.PANId = DEFAULT_PAN_ID;
    coord_addr_spec.Addr.short_address = coord_addr;
#ifdef SIO_HUB
    printf("Poll coordinator\r\n");
#endif
    wpan_mlme_poll_req(&coord_addr_spec);
    /*Keep compiler happy*/
    parameter = parameter;
}

/*
 * @brief Callback function indicating network search
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void network_search_indication_cb(void *parameter)
{
    LED_Toggle(LED_NWK_SETUP);

    /* Re-start led timer again. */
    sw_timer_start(APP_TIMER_LED_OFF,
                    LED_ON_DURATION,
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)network_search_indication_cb,
                    NULL);

    parameter = parameter;    /* Keep compiler happy. */
}

/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *
 */
static void rx_data_led_off_cb(void *parameter)
{
    LED_Off(LED_DATA);

    parameter = parameter;    /* Keep compiler happy. */
}

/*
 * @brief function for the sending received data back to coordinator
 *
 * @param data Pointer to received data
 *
 */
static void send_data(uint8_t *data)
{
    /*
     * Send some data and restart timer.
     * Use: bool wpan_mcps_data_req(uint8_t SrcAddrMode,
     *                              wpan_addr_spec_t *DstAddrSpec,
     *                              uint8_t msduLength,
     *                              uint8_t *msdu,
     *                              uint8_t msduHandle,
     *                              uint8_t TxOptions);
     *
     * This request will cause a mcps data confirm message ->
     * usr_mcps_data_conf
     */

    uint8_t src_addr_mode;
    wpan_addr_spec_t dst_addr;
    static uint8_t msduHandle = 0;

    src_addr_mode = WPAN_ADDRMODE_SHORT;

    dst_addr.AddrMode = WPAN_ADDRMODE_SHORT;
    dst_addr.PANId = DEFAULT_PAN_ID;
    ADDR_COPY_DST_SRC_16(dst_addr.Addr.short_address, coord_addr);

    msduHandle++;
    wpan_mcps_data_req(src_addr_mode,
                       &dst_addr,
                       1,
                       data,
                       msduHandle,
                       WPAN_TXOPT_ACK);

}
